events/test/artillery.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 20
    - duration: 60
      arrivalRate: 30
    - duration: 60
      arrivalRate: 40
    - duration: 60
      arrivalRate: 50
    - duration: 60
      arrivalRate: 60
    - duration: 60
      arrivalRate: 70
    - duration: 60
      arrivalRate: 80
    - duration: 60
      arrivalRate: 90
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/booking/1"